import 'package:oop_examples/encapsulation/bank/bank_account.dart';

//1. Успішне зняття суми менше 1000 грн.
//2. Не успішне зняття коштів більше 1000 грн.
//3. Ми хочемо взяти гроші в кредит.
//4. Не успішна спроба взяти гроші в кредит.
//5. Успішна спроба взяти гроші в кредит.
//6. Як в поточній реалізації можно обійтись без кредиту?
//7. Як ми це можемо виправити?

void main() {
  final account = BankAccount();

  print('Баланс перед зняттям: ${account.balance}');

  account.withdraw(900);

  print('Баланс після зняття: ${account.balance}');
}
